Revit 2026 API

# PointLoadIsValidHostId Method

---

Indicates if the provided host id can host point loads The document containing both the host and the load The id of the analytical element that is about to host a point load True if a point load can be placed on the input host id

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidHostId(
	Document pDoc,
	ElementId hostId
)
```
```vb
Public Shared Function IsValidHostId (
	pDoc As Document,
	hostId As ElementId
) As Boolean
```
```cpp
public:
static bool IsValidHostId(
	Document^ pDoc,
	ElementId^ hostId
)
```
```fsharp
static member IsValidHostId :
        pDoc : Document *
        hostId : ElementId -> bool
```

#### Parameters

pDoc Document

hostId ElementId

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PointLoad Class

Autodesk.Revit.DB.Structure Namespace